<template>
	<c-app :curentSystem="$vuetify.t('$vuetify.texts.main.links.psyhTests.name')" :panelLeft="{show:true}">
		<v-layout align-space-between justify-center column fill-height ml-1>
			<v-flex>
				<v-tabs
						show-arrows
						dark
						color="transparent"
				>
					<v-tabs-slider color="orange"></v-tabs-slider>

					<v-tab
							v-for="tab in tabs"
							:href="'#tab-' + tab.id"
							:key="tab.id"
						>
						{{ tab.title }}
					</v-tab>

					<v-tabs-items>
						<v-tab-item value="tab-1">
							<v-card flat style="background:transparent;">
								<v-card-text>
									<v-stepper v-model="test1" vertical dark style="background:transparent;">
										<v-stepper-step :complete="test1 > 1" step="1">
											Инструкция
											<small></small>
										</v-stepper-step>
										<v-stepper-content step="1">
											<v-card color="white black--text" class="mb-1 pa-2">
												"Представьте себе, что после соответствующего обучения Вы сможете успешно работать абсолютно по любой профессии и в любой сфере деятельности.
												<br>Однако, Вам необходимо выбрать только одну из двух представленных Вам возможностей.
												<br><br>Начнём тестирвоание...
											</v-card>
											<v-btn color="primary" @click="test1 = 2">Начать тестирование</v-btn>
										</v-stepper-content>


										<template v-for="(item, key) in test1_q">
											<v-stepper-step :complete="test1 > (key+2)" :step=key+2>Вопрос № {{ key+1 }}. Что Вы предпочтете?</v-stepper-step>
											<v-stepper-content :step=key+2>
												<v-card color="white black--text" class="mb-1 pa-2">
													<b>1А.</b> {{ item.a }}
													<br><br>
													<b>1Б.</b> {{ item.b }}
												</v-card>
												<v-btn color="primary" @click="saveAnsw(item.res_a);test1=key+3">1а</v-btn>
												<v-btn color="primary" @click="saveAnsw(item.res_b);test1=key+3">1б</v-btn>

												<v-btn color="primary" @click="test1=key+3">Пропустить</v-btn>
												<v-btn color="primary" @click="test1=key+1">Назад</v-btn>
											</v-stepper-content>
										</template>

										<v-stepper-step :complete="test1 > (test1_q.length+2)" :step=test1_q.length+2 >Окончание теста:</v-stepper-step>
										<v-stepper-content :step=test1_q.length+2>
											<v-card color="white black--text" class="mb-1 pa-2">
												Спасибо! Тест закончен, осталость только отправить данные на сервер.
											</v-card>
											<v-btn color="primary" @click="test1=1">Завершить тестирование и отправить результат</v-btn>
										</v-stepper-content>
									</v-stepper>

								</v-card-text>
							</v-card>
						</v-tab-item>

					<v-tab-item value="tab-2">
						<v-card flat style="background:transparent;">
							<v-card-text>
								<v-stepper v-model="test2" vertical dark style="background:transparent;">
									<v-stepper-step :complete="test2 > 1" step="1">
										Инструкция
										<small></small>
									</v-stepper-step>

									<v-stepper-content step="1">
										<v-card color="white black--text" class="mb-5 pa-2">Идёт разработка теста ...</v-card>
										<v-btn color="primary" disabled>Начать тестирование</v-btn>
									</v-stepper-content>
								</v-stepper>

							</v-card-text>
						</v-card>
					</v-tab-item>

					<v-tab-item value="tab-3">
						<v-card flat style="background:transparent;">
							<v-card-text>
								<v-stepper v-model="test2" vertical dark style="background:transparent;">
									<v-stepper-step :complete="test2 > 1" step="1">
										Инструкция
										<small></small>
									</v-stepper-step>

									<v-stepper-content step="1">
										<v-card color="white black--text" class="mb-5 pa-2">Идёт разработка теста ...</v-card>
										<v-btn color="primary" disabled>Начать тестирование</v-btn>
									</v-stepper-content>
								</v-stepper>

							</v-card-text>
						</v-card>
					</v-tab-item>
					</v-tabs-items>

				</v-tabs>


			</v-flex>
		</v-layout>
	</c-app>
</template>

<script>
	import XApp from '../mixins/x-app'
    import axios from 'axios'

	export default {
		data: () => ({
            tabs:[
                {id:1, title:'Тест по профориентации' 	 },
                {id:2, title:'Определение личности'  },
                {id:3, title:'Сильные и слабые стороны'  },
            ],
            test1: 1,
            test1_q:[
                {res_a:'1|20;2|20;3|10;4|10;6|30;124|5', res_b:'107|10;100|15;97|12;96|15;90|20;93|5', a:'Ухаживать за животными, лечить их, создавать приюты для животных', b:'Работать на технических агрегатах,  приборах, следить за показаниями приборов и регулировать их'},
                {res_a:'125|5;120|3;72|10;63|5;46|30;47|12;38|20;35|30;41|15', res_b:'102|30;95|35;96|10;92|4;112|10', a:'Заботиться о детях, стариках, лечить людей, помогать больным, представлять страну на гуманитарных форумах', b:'Составлять алгоритмы, таблицы, схемы, писать компьютерные программы'},
                {res_a:'82|30;81|15;83|10;75|12;72|8', res_b:'2|35;3|15;8|5;51|8', a:'Участвовать в оформлении  баннеров,  рекламных буклетов, создавать книжные иллюстрации и рисовать комиксы.', b:'Выращивать чудодейственные растения, изучать природу и ее проявления'},
                {res_a:'74|20;76|20;81|12;90|20;94|18;98|25;99|35;100|19', res_b:'116|20;115|15;114|15;62|20;59|20;56|15;54|15;55|15;52|25;49|35', a:'Делать своими руками что – либо из дерева, ткани, бусин, металла, пластмассы и т.п.', b:'Рекламировать товары, придумывать рекламные кампании, добиваться, чтобы рекламируемые Вами товары покупали'},
                {res_a:'37|30;43|35;44|10;71|12;88|8;95|12;102|10;112|12', res_b:'85|30;81|5;74|5;72|18;69|8;65|30;57|14;51|12', a:'Заниматься современными научными направлениями, исследованиями, участвовать в научных форумах', b:'Принимать участие в создании художественных образов в спектаклях, КВН, комедийных постановках'},
                {res_a:'2|12;30|10;37|35;38|12;43|18', res_b:'41|35;42|30;35|12;51|5', a:'Заниматься генной инженерией, выводить и выращивать животных новой  породы.', b:'Заниматься с малышами и младшими школьниками, помогать им  в выполнении трудовых, учебных, спортивных и иных  заданий '},
                {res_a:'64|12;65|20;72|18;74|25;75|5;85|8', res_b:'92|20;93|5;103|30;104|30;106|30;107|35', a:'Играть на  музыкальных инструментах, петь, участвовать в концертах и международных конкурсах', b:'Управлять  транспортными средствами: машиной, скутером, велосипедом, самолетом, пароходом и др.'},
                {res_a:'62|20;59|10;56|10;52|25;51|20;26|15', res_b:'63|20;75|15;74|10;82|25', a:'Помогать окружающим находить  нужные  сведения в Интернете, на сайтах, организовывать и проводить встречи с известными людьми', b:'Проявлять авторство в оформлении выставок, светящихся витрин, динамичных рекламных баннеров'},
                {res_a:'90|20;89|5;92|18;95|15;96|19;99|30;97|5;98|6;110|18', res_b:'101|30;102|10;95|18;112|20;117|15;124|10', a:'Ремонтировать все по дому: технику, вещи, изделия', b:'Работать с текстами, рисунками, графиками, таблицами, придумывать для них шаблоны'},
                {res_a:'1|18;2|22;6|35;38|5', res_b:'16|20;26|5;89|30;97|20;95|10', a:'Работать в области медицины  животных', b:'Обеспечивать выполнение необходимых  вычислений, расчетов, диаграмм'},
                {res_a:'44|20;43|25;37|30', res_b:'43|10;88|20;96|10;100|15;99|35;101|15', a:'Выводить новые сорта растений для нужд людей ', b:'Конструировать,   проектировать и создавать новые, необычные  виды материалов, машин '},
                {res_a:'125|20;121|18;120|20;51|12;46|20;52|10', res_b:'101|30;102|10;95|18;112|20;117|15;124|10', a:'Выступать в качестве миротворца в спорах, ссоры между людьми, убеждать, разъяснять ', b:'Разбираться в чертежах, схемах, таблицах'},
                {res_a:'74|20;75|10;82|16;73|5;95|10', res_b:'37|15;43|25;44|20;89|5', a:'Заниматься творчеством: современные танцы, песни, игры и.д.', b:'Работать с микроскопом:  изучать жизнь вирусов, микробов'},
                {res_a:'100|15;97|12;99|20;43|10;37|5', res_b:'8|35;9|20;10|25;16|5', a:'Конструировать современные медицинские приборы, искусственные органы и препараты.', b:'Работать как МЧС, оказывать помощь при наводнениях, землетрясениях, экстренных ситуациях.'},
                {res_a:'43|35;37|10;44|15', res_b:'26|10;59|15;65|18;66|20;69|15;71|18;72|22', a:'Изучать явления, события с точки зрения науки, исследовать,  их,  описывать результаты о наблюдаемых явлениях, событиях, измеряемых объектах и др. ', b:'Изображать, пародировать или представлять друзей, знакомых,  их действия в  разных ситуациях, быть блогером.'},
                {res_a:'43|15;35|22;37|5', res_b:'43|15;38|30;30|20;32|30', a:'Делать лабораторные анализы в диагностических центрах', b:'Проводить диагностику болезней людей, придумывать и назначать лечение'},
                {res_a:'74|35;75|20;65|10;82|25', res_b:'99|35;101|25;96|20', a:'Расписывать стены помещений, поверхность изделий, создавать художественные образы в цвете', b:'Монтировать или собирать машины, приборы, агрегаты, космические аппараты'},
                {res_a:'72|15;59|25;46|5;53|10;52|15', res_b:'53|10;57|15;65|20', a:'Организовывать и участвовать в  походах, квестах, прыгать на тарзанке', b:'Принимать участие в концертах, спектаклях сценках КВН'},
                {res_a:'101|15;95|30;98|18;97|18;92|30', res_b:'101|30;99|20;102|10', a:'Работать с чертежами, превращая их в машины, дома, станки, роботов', b:'Проектировать новые агрегаты, искусственный интеллект'},
                {res_a:'88|5;72|10;3|20;8|10;2|15', res_b:'25|20;28|12;42|5;68|30;70|15;95|15;102|5', a:'Заниматься экологий нашей земли, делать ее чище, красивее, бороться  с вредителями леса, сада', b:'Работать на клавиатуре компьютера, печатать тексты,  программы и др.'},
            ],
            test2: 1,
		}),
		mixins: [
			XApp,
		],
		methods: {
            saveAnsw(res){
                if (res!=""){
                    axios.post('setTestRate', {todo:res}).then(response => {
                    }).catch(e => {
                        console.log(e)
                    })
				}
			}
		},
		created: function (){
			let vm=this
		},
	}
</script>
<style>
</style>