<?php

namespace App\Models;

use Illuminate\Notifications\Notifiable;
use Illuminate\Foundation\Auth\User as Authenticatable;
use Illuminate\Support\Facades\Auth;
use App\Events\DataInfo ;

class User extends Authenticatable{
    use Notifiable;

    /**
     * The attributes that are mass assignable.
     *
     * @var array
     */
	protected $table = '_users';
    protected $primaryKey = 'id';
    protected $dates = [  'created_at', 'updated_at'];
    protected $fillable = [
        'id','login', 'firstname', 'lastname', 'password','name','token', 'storage','password','timestamps','email1','systemLanguage','user_system','avatar','bio','favoritCitys','favoritUnivs','favoritDist','favoritProfs','birthCity', 'birthDate', 'residenceCity'
    ];
    /**
     * The attributes that should be hidden for arrays.
     *
     * @var array
     */
    protected $hidden = [
        'password', 'remember_token',
    ];

	public  function getUserInfo($userId){
        $data =  $this->select('firstName','lastName','birthDate','residenceCity','bio','favoritCitys','favoritUnivs','favoritDist','favoritProfs','birthCity' )->where('id' ,'=',$userId)->get()->toArray();
        $data[0]['schls'] = (new Sch2user)->getSchByUser($userId);
        $data[0]['eges'] = (new Ege)->getVal($userId);
		return $data[0];
    }

	public  function saveFavorits($data){
        $this->where('id',Auth::user()->id )
            ->update(['favoritCitys' => $data['todo']['favoritCitys'], 'favoritUnivs' => $data['todo']['favoritUnivs'], 'favoritDist' => $data['todo']['favoritDist'], 'favoritProfs' => $data['todo']['favoritProfs'] ]);
    }

	public  function saveUserInfo($todo){
        $this->where('id',Auth::user()->id )
            ->update(['FirstName' => $todo['firstName'], 'LastName' => $todo['lastName'], 'birthDate' => $todo['birthDate'],'birthCity' => $todo['birthCity'], 'residenceCity' => $todo['residenceCity'], 'bio' => $todo['bio'] ]);
		$match= new match;
		$match->where('user_id',Auth::user()->id )->where('type','astro')->delete();
		(new Astro2User)->where('user_id',Auth::user()->id )->delete();
		$myCurl = curl_init();
		curl_setopt_array($myCurl, array(
			CURLOPT_URL => 'https://astro-online.ru/aspects_of_profession.html',
			CURLOPT_RETURNTRANSFER => true,
			CURLOPT_COOKIEJAR=>env('ASTRO_COOKIE_FILE', 'C:\wamp\www\LIFE_PLAN\storage\app\cookie.txt')
		));		
		include 'simple_html_dom.php';
		$response = str_get_html( curl_exec($myCurl) );
		$ssid=$response->find('input[name=ssid]');
		$response->clear();
		$citiesArr=["АША" => 1011,
			"АБАКАН" => 2, "АБДУЛИНО" => 3, "АЗОВ" => 4, "АЙЗПУТЕ" => 5, "АЙНАЖИ" => 6, "АЙРУМ" => 7, "АК-ДОВУРАК" => 9, "АКБУЛАК" => 8, "АКТАУ" => 10, "АКТАШ" => 11, "АЛАВЕРДИ" => 12, 
			"АЛАГИР" => 13, "АЛАПАЕВСК" => 14, "АЛАТЫРЬ" => 15, "АЛЕЙСК" => 16, "АЛЕКСАНДРИЯ" => 17, "АЛЕКСАНДРОВ" => 18, "АЛЕКСАНДРОВСК САХ." => 19, "АЛЕКСИН" => 20, "АЛИТУС" => 21, 
			"АЛМА-АТА" => 22, "АЛУШТА" => 23, "АЛЧЕВСК" => 24, "АЛЬМЕТЬЕВСК" => 25, "АМУРСК" => 26, "АНАДЫРЬ" => 27, "АНГАРСК" => 28, "АНЖЕРО-СУДЖЕНСК" => 29, "АНИПЕМЗА" => 30, "АННА" => 31, 
			"АПАТИТЫ" => 32, "АПЕ" => 33, "АРАРАТ" => 34, "АРЗАМАС" => 35, "АРКАДАК" => 36, "АРМАВИР" => 37, "АРСЕНЬЕВ" => 38, "АРСК" => 39, "АРТАШАТ" => 40, "АРТЕМ" => 41, "АРТЕМОВСК" => 42, 
			"АРТЕМОВСКИЙ" => 43, "АРТИК" => 44, "АРХАНГЕЛЬСК" => 45, "АРШАНЬ" => 46, "АСБЕСТ" => 47, "АСИНО" => 48, "АСТАНА" => 1092, "АСТРАХАНЬ" => 49, "АТКАРСК" => 50, "АУЦЕ" => 51, "АХАЛКАЛАКИ" => 52, 
			"АХАЛЦИХЕ" => 53, "АХТУБИНСК" => 54, "АХТЫРКА" => 55, "АЧИНСК" => 56, "АШТАРАК" => 57, "АЯГУЗ" => 58, "АЯНКА" => 59, "БАБАЕВО" => 60, "БАГРАТИОНОВСК" => 61, "БАЙМАК" => 62, "БАКАЛ" => 63, 
			"БАКУ" => 64, "БАЛАКОВО" => 65, "БАЛАШИХА" => 66, "БАЛАШОВ" => 67, "БАЛТА" => 68, "БАЛЫЧЫГАН" => 69, "БАРАНОВИЧИ" => 70, "БАРГУЗИН" => 71, "БАРНАУЛ" => 72, "БАРЫШ" => 73, "БАТАЙСК" => 74, 
			"БАТУМИ" => 75, "БАХМАЧ" => 76, "БАХЧИСАРАЙ" => 77, "БЕЖЕЦК" => 78, "БЕЛАЯ ЦЕРКОВЬ" => 79, "БЕЛГОРОД" => 80, "БЕЛГОРОД-ДНЕСТРОВСКИЙ" => 81, "БЕЛОВО" => 83, "БЕЛОГОРСК" => 85, "БЕЛОГОРСК" => 84,
			"БЕЛОЗЕРСК" => 86, "БЕЛОМОРСК" => 87, "БЕЛОПОЛЬЕ" => 88, "БЕЛОРЕЦК" => 89, "БЕЛЬЦЫ" => 90, "БЕНДЕРЫ" => 91, "БЕРД" => 92, "БЕРДИЧЕВ" => 93, "БЕРДСК" => 94, "БЕРДЯНСК" => 95, "БЕРЕЖАНЫ" => 96, 
			"БЕРЕЗНИКИ" => 97, "БЕРЕЗОВЫЙ" => 98, "БЕРИСЛАВ" => 99, "БИАЗА" => 100, "БИЙСК" => 101, "БИЛИБИНО" => 102, "БИРЖАЙ" => 103, "БИРОБИДЖАН" => 104, "БЛАГОВЕЩЕНКА" => 105, "БЛАГОВЕЩЕНСК" => 106, 
			"БЛАГОВЕЩЕНСК" => 107, "БОБРИНЕЦ" => 108, "БОБРУЙСК" => 109, "БОГДАНОВИЧ" => 110, "БОГОДУХОВ" => 111, "БОЛНИСИ" => 112, "БОЛОГОЕ" => 113, "БОЛОТНОЕ" => 114, "БОЛЬШЕРЕЧЬЕ" => 115, "БОРЖОМИ" => 116, 
			"БОРЗЯ" => 117, "БОРИСОВ" => 118, "БОРИСОВКА" => 119, "БОРИСОГЛЕБСК" => 120, "БОРИСПОЛЬ" => 121, "БОРОВИЧИ" => 122, "БРАТСК" => 123, "БРЕСТ" => 124, "БРИЧАНЫ" => 125, "БРОДЫ" => 126, "БРЯНСК" => 127, 
			"БУГУЛЬМА" => 128, "БУГУРУСЛАН" => 129, "БУДЕННОВСК" => 130, "БУЗУЛУК" => 131, "БУИНСК" => 132, "БУЙ" => 133, "БУЙНАКСК" => 134, "БЫХОВ" => 135, "ВАЛГА" => 136, "ВАЛДАЙ" => 137, "ВАЛМИЕРА" => 138, 
			"ВАЛУЙКИ" => 139, "ВАНИНО" => 140, "ВАНКАРЕМ" => 141, "ВАРЕНА" => 142, "ВАСИЛЬКОВ" => 143, "ВАСКНАРВА" => 144, "ВАТУТИНО" => 145, "ВЕЛИКИЕ ЛУКИ" => 146, "ВЕЛИКИЙ УСТЮГ" => 147, "ВЕЛЬСК" => 148, "ВЕНТСПИЛС" => 149,
			"ВЕРДЕНИС" => 150, "ВЕРХНЕИМБАТСК" => 151, "ВЕРХНЕКОЛЫМСК" => 152, "ВЕРХНЕУРАЛЬСК" => 153, "ВЕРХНИЙ БАСКУНЧАК" => 154, "ВЕРХНИЙ УФАЛЕЙ" => 155, "ВЕРХНЯЯ САЛДА" => 156, "ВЕРХОЯНСК" => 157, "ВЕТЛУГА" => 158, 
			"ВИЖНИЦА" => 159, "ВИЛЕЙКА" => 160, "ВИЛКОВО" => 161, "ВИЛЬКИЯ" => 162, "ВИЛЬНЮС" => 163, "ВИЛЬЯНДИ" => 164, "ВИЛЮЙСК" => 165, "ВИННИЦА" => 166, "ВИТЕБСК" => 167, "ВИЧУГА" => 168, "ВЛАДИВОСТОК" => 169, 
			"ВЛАДИКАВКАЗ" => 170, "ВЛАДИМИР" => 171, "ВОЗНЕСЕНСК" => 172, "ВОЛГОГРАД" => 173, "ВОЛГОДОНСК" => 174, "ВОЛЖСК" => 175, "ВОЛЖСКИЙ" => 176, "ВОЛКОВЫСК" => 177, "ВОЛНОВАХА" => 178, "ВОЛОГДА" => 179, 
			"ВОЛОКОЛАМСК" => 180, "ВОЛХОВ" => 181, "ВОЛЬСК" => 182, "ВОРКУТА" => 183, "ВОРОНЕЖ" => 184, "ВОРОПАЕВО" => 185, "ВОТКИНСК" => 186, "ВУКТЫЛ" => 187, "ВЫБОРГ" => 188, "ВЫКСА" => 189, "ВЫРУ" => 190, 
			"ВЫТЕГРА" => 191, "ВЫШНИЙ ВОЛОЧЕК" => 192, "ВЯЗЕМСКИЙ" => 193, "ВЯЗНИКМ" => 194, "ВЯЗЬМА" => 195, "ГАВРИЛОВ-ЯМ" => 196, "ГАГОДЕХИ" => 197, "ГАГРА" => 198, "ГАДЯЧ" => 199, "ГАЙСИН" => 200, "ГАЛИ" => 201, 
			"ГАЛИЧ" => 202, "ГАТЧИНА" => 203, "ГВАРДЕЙСК" => 204, "ГВАРДЕЙСКОЕ" => 205, "ГДОВ" => 206, "ГЕНИЧЕСК" => 207, "ГЕОРГИЕВСК" => 208, "ГЕОРГИУ-ДЕЖ" => 209, "ГЛАЗОВ" => 210, "ГЛУБОКОЕ" => 211, 
			"ГОЛЫШМАНОВО" => 212, "ГОМЕЛЬ" => 213, "ГОРИ" => 214, "ГОРИС" => 215, "ГОРКИ" => 216, "ГОРЛОВКА" => 217, "ГОРНО-АЛТАЙСК" => 218, "ГРИГОРИОПОЛЬ" => 220, "ГРОДНО" => 221, "ГРОЗНЫЙ" => 222, "ГРЯЗИ" => 223, 
			"ГРЯЗОВЕЦ" => 224, "ГУБКИН" => 225, "ГУДАУТА" => 226, "ГУДЕРМЕС" => 227, "ГУКОВО" => 228, "ГУЛБИТИС" => 229, "ГУЛЯЙПОЛЕ" => 230, "ГУСЕВ" => 231, "ГУСИНООЗЕРСК" => 232, "ГУСЬ-ХРУСТАЛЬНЫЙ" => 233, 
			"ДАЛЬНЕГОРСК" => 234, "ДАЛЬНЕРЕЧЕНСК" => 235, "ДАНИЛОВ" => 236, "ДАРАСУН" => 237, "ДАУГАВПИЛС" => 238, "ДЕРБЕНТ" => 239, "ДЖАВА" => 240, "ДЖАНКОЙ" => 241, "ДЖЕРМУК" => 242, "ДЗЕРЖИНСК" => 243, 
			"ДИКСОН" => 244, "ДИЛИЖАН" => 245, "ДИСНА" => 246, "ДМИТРОВ" => 247, "ДМИТРОВГРАД" => 248, "ДНЕПРОДЗЕРЖИНСК" => 249, "ДНЕПРОПЕТРОВСК" => 250, "ДНО" => 251, "ДОБРЯНКА" => 252, "ДОЛИНСК" => 253, 
			"ДОНЕЦК" => 254, "ДРОГОБЫЧ" => 255, "ДРУСКИНИНКАЙ" => 256, "ДУБНА" => 257, "ДУБНО" => 258, "ДУБОССАРЫ" => 259, "ДУВАН" => 260, "ДУДИНКА" => 261, "ЕВПАТОРИЯ" => 262, "ЕГОРЬЕВСК" => 263, "ЕДИНЦЫ" => 264, 
			"ЕЙСК" => 265, "ЕКАТЕРИНБУРГ" => 266, "ЕЛАНЬ" => 267, "ЕЛГАВА" => 268, "ЕЛЕКТРОСТАЛЬ" => 269, "ЕЛЕЦ" => 270, "ЕМВА" => 271, "ЕНИСЕЙСК" => 272, "ЕРЕВАН" => 273, "ЕРМАК" => 274, "ЕРШОВ" => 275, 
			"ЕССЕНТУКИ" => 276, "ЕФРЕМОВ" => 277, "ЕХЕГНАДЗОР" => 278, "ЖЕЛЕЗНОГОРСК" => 280, "ЖЕЛЕЗНОГОРСК" => 279, "ЖЕРДЕВКА" => 282, "ЖИНДО" => 283, "ЖИРНОВСК" => 284, "ЖИТКОВИЧИ" => 285, "ЖИТОМИР" => 286, 
			"ЖЛОБИН" => 281, "ЖМЕРИНКА" => 287, "ЗАВИТИНСК" => 288, "ЗАВОДОУКОВСК" => 289, "ЗАВОЛЖЬЕ" => 290, "ЗАГОРСК" => 291, "ЗАЙСАН" => 292, "ЗАКАМЕНСК" => 293, "ЗАПАДНАЯ ДВИНА" => 294, "ЗАПОРОЖЬЕ" => 295, 
			"ЗАРАСАЙ" => 296, "ЗВЕНИГОРОДКА" => 297, "ЗЕЛЕНОГРАД" => 298, "ЗЕЛЕНОГРАДСК" => 299, "ЗЕЛЕНОДОЛЬСК" => 300, "ЗЕМЕТЧИНО" => 301, "ЗЕСТАФОНИ" => 302, "ЗЕЯ" => 303, "ЗИЛУПЕ" => 304, "ЗИМА" => 305, 
			"ЗИМОВНИКИ" => 306, "ЗЛАТОУСТ" => 307, "ЗУГДИДИ" => 308, "ЗУЕВКА" => 309, "ЗЫРЯНОВСК" => 310, "ИВАНО-ФРАНКОВСК" => 312, "ИВАНОВО" => 311, "ИВДЕЛЬ" => 313, "ИГАРКА" => 314, "ИГРА" => 315, "ИДЖЕВАН" => 316, 
			"ИЖЕВСК" => 317, "ИЖМА" => 318, "ИЗБЕРБАШ" => 319, "ИЗМАИЛ" => 320, "ИЗЮМ" => 321, "ИЗЯСЛАВ" => 322, "ИНЗА" => 323, "ИНТА" => 324, "ИРБИТ" => 325, "ИРКУТСК" => 326, "ИРПЕНЬ" => 327, "ИРТЫШСК" => 328, 
			"ИСИЛЬКУЛЬ" => 329, "ИСКИТИМ" => 330, "ИССЫК" => 331, "ИШИМ" => 332, "ИШИМБАЙ" => 333, "ЙОШКАР-ОЛА" => 334, "ЙЫГЕВА" => 335, "КАВАЛЕРОВО" => 336, "КАГУЛ" => 337, "КАДЖАРАН" => 338, "КАДУЙ" => 339, 
			"КАЗАНЬ" => 340, "КАЗАТИН" => 341, "КАЗБЕГИ" => 342, "КАЗЫМ-МЫС" => 343, "КАЙНАР" => 344, "КАЛАРАШ" => 345, "КАЛАЧ НА ДОНУ" => 346, "КАЛАЧИНСК" => 347, "КАЛИНИНГРАД" => 348, "КАЛИНИНГРАД" => 349, 
			"КАЛИНИНСК" => 350, "КАЛИНКОВИЧИ" => 351, "КАЛУГА" => 352, "КАЛУШ" => 353, "КАЛЯЗИН" => 354, "КАМЕНЕЦ-ПОДОЛЬСКИЙ" => 355, "КАМЕНКА" => 356, "КАМЕНСК ШАХТИНСКИЙ" => 357, "КАМЕНСК-УРАЛЬСКИЙ" => 358, 
			"КАМЕНЬ-НА ОБИ" => 359, "КАМЫЗЯК" => 360, "КАМЫШИН" => 361, "КАМЫШЛА" => 362, "КАНАДЕЙ" => 363, "КАНАШ" => 364, "КАНДАЛАКША" => 365, "КАНСК" => 366, "КАПСУКАС" => 367, "КАПУСТИН ЯР" => 368, "КАПЧАГАЙ" => 369, 
			"КАРАГАНДА" => 370, "КАРАСУК" => 372, "КАРАЧАЕВСК" => 373, "КАРАЧЕВ" => 374, "КАРГАПОЛЬ" => 375, "КАРКАРАЛИНСК" => 371, "КАРТАЛЫ" => 376, "КАСИМОВ" => 377, "КАСКЕЛЕН" => 378, "КАСПИ" => 379, "КАСПИЙСК" => 380, 
			"КАСПИЙСКИЙ" => 381, "КАТАЙГА" => 382, "КАТАЙСК" => 383, "КАУНАС" => 384, "КАФАН" => 385, "КАЧКАНАР" => 386, "КВАРЕЛИ" => 387, "КЕДАЙНЯЙ" => 388, "КЕЙЛА" => 389, "КЕМЕРОВО" => 390, "КЕМЬ" => 391, "КЕРЧЬ" => 392,
			"КИБАРТАЙ" => 393, "КИЕВ" => 394, "КИЗЕЛ" => 395, "КИЗЛЯР" => 396, "КИЛИНГИ" => 397, "КИЛИЯ" => 398, "КИМРЫ" => 399, "КИНГИСЕПП" => 400, "КИНЕШМА" => 401, "КИРЕНСК" => 402, "КИРИШИ" => 403, "КИРОВ" => 405, 
			"КИРОВ" => 404, "КИРОВАКАН" => 406, "КИРОВО-ЧЕПЕЦК" => 408, "КИРОВОГРАД" => 407, "КИРСАНОВ" => 409, "КИСЕЛЕВСК" => 410, "КИСЛОВОДСК" => 411, "КИШИНЕВ" => 412, "КЛАЙПЕДА" => 413, "КЛЕТНЯ" => 414, "КЛИМОВИЧИ" => 415,
			"КЛИН" => 416, "КЛИНЦЫ" => 417, "КОБРА" => 418, "КОБРИН" => 419, "КОБУЛЕТИ" => 420, "КОВЕЛЬ" => 421, "КОВРОВ" => 422, "КОВЫЛКМНО" => 423, "КОЗЬМОДЕМЬЯНСК" => 424, "КОЛКА" => 425, "КОЛОМНА" => 426, "КОЛОМЫЯ" => 427, 
			"КОЛПАШЕВО" => 428, "КОЛПИНО" => 429, "КОМРАТ" => 430, "КОМСОМОЛЬСК НА АМУРЕ" => 431, "КОМСОМОЛЬСКИЙ" => 433, "КОМСОМОЛЬСКИЙ" => 432, "КОНДА" => 434, "КОНДОПОГА" => 435, "КОНОТОП" => 436, "КОНОША" => 437, 
			"КОПЕЙСК" => 438, "КОРКИНО" => 439, "КОРНЕШТЫ" => 440, "КОРОСТЕНЬ" => 441, "КОРЯЖМА" => 442, "КОСТОМУКША" => 443, "КОСТРОМА" => 444, "КОТЕЛЬНИКОВО" => 445, "КОТЕЛЬНИЧ" => 446, "КОТЛАС" => 447, "КОТОВСК" => 448, 
			"КОТОВСК" => 449, "КОХТЛА ЯРВЕ" => 450, "КОЧУБЕЙ" => 451, "КРАМАТОРСК" => 452, "КРАПИВНАЯ" => 453, "КРАСНОАРМЕЙСК" => 454, "КРАСНОВИШЕРСК" => 455, "КРАСНОГРАД" => 456, "КРАСНОДАР" => 457, "КРАСНОДОН" => 458, 
			"КРАСНОЗНАМЕНСК" => 459, "КРАСНОКАМЕНСК" => 460, "КРАСНОКАМСК" => 461, "КРАСНОПЕРЕКОПСК" => 462, "КРАСНОСЛОБОДСК" => 463, "КРАСНОТУРЬИНСК" => 464, "КРАСНОУФИМСК" => 465, "КРАСНОЯРСК" => 466, "КРАСНЫЙ КУТ" => 467,
			"КРАСНЫЙ ЛУЧ" => 468, "КРЕМЕНЕЦ" => 469, "КРЕМЕНЬЧУГ" => 470, "КРЕТИНГА" => 471, "КРИВОЙ РОГ" => 472, "КРИЧЕВ" => 473, "КРОЛЕВЕЦ" => 474, "КРОНШТАДТ" => 475, "КРОПОТКИН" => 476, "КСТОВО" => 477, "КУДЫМКАР" => 478,
			"КУЗНЕЦК" => 479, "КУЙБЫШЕВ" => 480, "КУКМОД" => 481, "КУЛДИГА" => 482, "КУЛУНДА" => 483, "КУМЕРТАУ" => 484, "КУНГУР" => 485, "КУПИНО" => 486, "КУПЯНСК" => 487, "КУРГАН" => 488, "КУРСК" => 489, "КУРТАМЫШ" => 490,
			"КУРЧАТОВ" => 491, "КУРШЕНАЙ" => 492, "КУТАИСИ" => 493, "КЫЗЫЛ" => 494, "КЫШТЫМ" => 495, "КЯРДЛА" => 496, "ЛАБИНСК" => 497, "ЛЕБЕДЯНЬ" => 498, "ЛЕНИНАКАН" => 499, "ЛЕНИНОГОРСК" => 501, "ЛЕНИНОГОРСК" => 500,
			"ЛЕНИНСК" => 502, "ЛЕНИНСК-КУЗНЕЦКИЙ" => 503, "ЛЕОВО" => 504, "ЛЕПЕЛЬ" => 505, "ЛЕСОЗАВОДСК" => 506, "ЛИВАНЫ" => 507, "ЛИВНЫ" => 508, "ЛИДА" => 509, "ЛИЕПАЯ" => 510, "ЛИПЕЦК" => 511, "ЛИСИЧАНСК" => 512, 
			"ЛОДЕЙНОЕ ПОЛЕ" => 513, "ЛОЗОВАЯ" => 514, "ЛОКОТЬ" => 515, "ЛУБНЫ" => 516, "ЛУГА" => 517, "ЛУГАНСК" => 518, "ЛУЗА" => 519, "ЛУЦК" => 520, "ЛУЧЕГОРСК" => 521, "ЛЫСКОВО" => 522, "ЛЫСЬВА" => 523, "ЛЬВОВ" => 524, 
			"ЛЮБЕРЦЫ" => 525, "ЛЮБОТИН" => 526, "МАГАДАН" => 527, "МАГНИТОГОРСК" => 528, "МАДОНА" => 529, "МАЖЕЙКЯЙ" => 530, "МАЙКАИН" => 531, "МАЙКОП" => 532, "МАКАРОВ" => 533, "МАКЕЕВКА" => 534, "МАКУШИНО" => 535, 
			"МАЛАЯ ВИШЕРА" => 536, "МАЛГОБЕК" => 537, "МАЛИН" => 538, "МАЛМЫЖ" => 539, "МАМАДЫШ" => 540, "МАМОНОВО" => 541, "МАРГАНЕЦ" => 542, "МАРИУПОЛЬ" => 543, "МАРНЕУЛИ" => 544, "МАРТУНИ" => 545, "МАРЬИНА ГОРКА" => 546,
			"МАХАРАДЗЕ" => 547, "МАХАЧКАЛА" => 548, "МЕДВЕЖЬЕГОРСК" => 549, "МЕДНОГОРСК" => 550, "МЕЖДУРЕЧЕНСК" => 551, "МЕЗЕНЬ" => 552, "МЕЛИТОПОЛЬ" => 553, "МЕНЗЕЛИНСК" => 554, "МЕНКЕРА" => 555, "МЕСТИА" => 556, 
			"МИАСС" => 557, "МИЛЛЕРОВО" => 558, "МИЛЬКОВО" => 559, "МИНЕРАЛЬНЫЕ ВОДЫ" => 560, "МИНСК" => 561, "МИНУСИНСК" => 562, "МИРГОРОД" => 563, "МИХАЙЛОВ" => 564, "МИХАЙЛОВКА" => 565, "МИЧУРИНСК" => 566, "МОГИЛЕВ" => 567,
			"МОГОЧА" => 568, "МОЖАЙСК" => 569, "МОЖГА" => 570, "МОЗДОК" => 571, "МОЗЫРЬ" => 572, "МОКШАН" => 573, "МОЛОДЕЧНО" => 574, "МОНДЫ" => 575, "МОНЧЕГОРСК" => 576, "МОРОЗОВСК" => 577, "МОРШАНСК" => 578, "МОСКВА" => 579,
			"МУКАЧЕВО" => 580, "МУРАШИ" => 581, "МУРМАНСК" => 582, "МУРМАШИ" => 583, "МУРОМ" => 584, "МУСТВЭЭ" => 585, "МЦЕНСК" => 586, "МЫЙЗАКЮЛА" => 587, "МЫТИЩИ" => 588, "НАБЕРЕЖНЫЕ ЧЕЛНЫ" => 589, "НАДЫМ" => 590,
			"НАЗРАНЬ" => 591, "НАЗЫВАЕВСК" => 592, "НАЛЬЧИК" => 593, "НАРВА" => 594, "НАРО-ФОМИНСК" => 595, "НАРЬЯН-МАР" => 596, "НАХОДКА" => 598, "НАХОДКА" => 597, "НЕВЕЛЬ" => 599, "НЕВИННОМЫССК" => 600, "НЕЖИН" => 601, 
			"НЕЛЬКАН" => 602, "НЕМАН" => 603, "НЕРЕХТА" => 604, "НЕРЮНГРИ" => 605, "НЕСТЕРОВ" => 606, "НЕФТЕГОРСК" => 607, "НЕФТЕКАМСК" => 608, "НЕФТЕКУМСК" => 609, "НЕФТЕЮГАНСК" => 610, "НЕЯ" => 611, "НИЖНЕВАРТОВСК" => 612,
			"НИЖНЕГОРСКИЙ" => 613, "НИЖНЕКАМСК" => 614, "НИЖНЕУДИНСК" => 615, "НИЖНИЙ ЛОМОВ" => 616, "НИЖНИЙ НОВГОРОД" => 617, "НИЖНИЙ ТАГИЛ" => 618, "НИКЕЛЬ" => 619, "НИКОЛАЕВ" => 620, "НИКОЛАЕВСК НА АМУРЕ" => 621, 
			"НИКОПОЛЬ" => 622, "НОВАЯ КАХОВКА" => 623, "НОВАЯ ЛЯЛЯ" => 624, "НОВГОРОД" => 625, "НОВОАЛЕКСАНДРОВСКАЯ" => 626, "НОВОАЛТАЙСК" => 627, "НОВОВОЛЫНСК" => 628, "НОВОГРУДОК" => 629, "НОВОДВИНСК" => 630, 
			"НОВОКУЗНЕЦК" => 631, "НОВОКУЙБЫШЕВСК" => 632, "НОВОМОСКОВСК" => 633, "НОВОМОСКОВСК" => 634, "НОВОРОССИЙСК" => 635, "НОВОСЕРГИЕВКА" => 636, "НОВОСИБИРСК" => 637, "НОВОТРОИЦК" => 638, "НОВОУЗЕНСК" => 639,
			"НОВОУКРАИНКА" => 640, "НОВОЧЕБОКСАРСК" => 641, "НОВОЧЕРКАССК" => 642, "НОВОШАХТИНСК" => 643, "НОВЫЙ БУГ" => 644, "НОВЫЙ ОСКОЛ" => 645, "НОВЫЙ УРЕНГОЙ" => 646, "НОГИНСК" => 647, "НОГЛИКИ" => 648, "НОЛИНСК" => 649,
			"НОРИЛЬСК" => 650, "НОЯБРЬСК" => 651, "НУРЛАТ" => 652, "НЫРОБ" => 653, "НЫЧАЛАХ" => 654, "НЯГАНЬ" => 655, "НЯНДОМА" => 656, "ОБЛУЧЬЕ" => 657, "ОБНИНСК" => 658, "ОБОЯНЬ" => 659, "ОВРУЧ" => 660, "ОГРЕ" => 661, 
			"ОДЕССА" => 662, "ОДИНЦОВО" => 663, "ОЗЕРСК" => 664, "ОЗИНКИ" => 665, "ОКТЕМБЕРЯН" => 666, "ОКТЯБРЬСКИЙ" => 667, "ОЛЕКМИНСК" => 668, "ОЛЕНЕГОРСК" => 669, "ОЛОВЯННАЯ" => 670, "ОМСК" => 671, "ОМУТНИНСК" => 672, 
			"ОНЕГА" => 673, "ОНИ" => 674, "ОПОЧКА" => 675, "ОРГЕЕВ" => 676, "ОРЕЛ" => 677, "ОРЕНБУРГ" => 678, "ОРЕХОВО-ЗУЕВО" => 679, "ОРЛОВСКИЙ" => 680, "ОРСК" => 681, "ОРША" => 682, "ОСИПОВИЧИ" => 683, "ОСТАШКОВ" => 684, 
			"ОСТРОВ" => 685, "ОУС" => 686, "ОХА" => 687, "ОХОТСК" => 688, "ОЧАКОВ" => 689, "ОЧАМЧИРА" => 690, "ОЧЕР" => 691, "ПАВЛОВО" => 692, "ПАВЛОВСК" => 693, "ПАВЛОГРАД" => 694, "ПАВЛОДАР" => 695, "ПАЙДЕ" => 696, 
			"ПАЛАНА" => 697, "ПАЛАНГА" => 698, "ПАЛЛАСОВКА" => 699, "ПАНЕВЕЖИС" => 700, "ПАНФИЛОВ" => 701, "ПАРЕНЬ" => 702, "ПАРТИЗАНСК" => 703, "ПАСАНАУРИ" => 704, "ПАХАЧИ" => 705, "ПЕВЕК" => 706, "ПЕНЗА" => 707, 
			"ПЕРВОМАЙСК" => 708, "ПЕРВОМАЙСКИЙ" => 710, "ПЕРВОМАЙСКИЙ" => 709, "ПЕРВОУРАЛЬСК" => 711, "ПЕРЕСЛАВЛЬ-ЗАЛЕССКИЙ" => 712, "ПЕРМЬ" => 713, "ПЕСТОВО" => 714, "ПЕСТРАВКА" => 715, "ПЕТРОВСК" => 716, 
			"ПЕТРОВСК ЗАБАЙКАЛЬСКИЙ" => 717, "ПЕТРОДВОРЕЦ" => 718, "ПЕТРОЗАВОДСК" => 719, "ПЕТРОПАВЛОВСК КАМЧ" => 720, "ПЕЧЕРА" => 721, "ПЕЧЕРЫ" => 722, "ПИНЕГА" => 723, "ПИНСК" => 724, "ПИРЯТИН" => 725, "ПИТКЯРАНТА" => 726, 
			"ПЛЕСЕЦК" => 727, "ПЛЯВИНЯС" => 728, "ПОГРАНИЧНЫЙ" => 729, "ПОДОЛЬСК" => 730, "ПОКРОВ" => 731, "ПОЛЕВСКИЙ" => 732, "ПОЛЕССК" => 733, "ПОЛОЦК" => 734, "ПОЛТАВА" => 735, "ПОТИ" => 736, "ПОХВИСТНЕВО" => 737, 
			"ПРАВДИНСК" => 738, "ПРИЛУКИ" => 739, "ПРИМОРСКО АХТАРСК" => 740, "ПРИОЗЕРСК" => 741, "ПРОКОПЬЕВСК" => 742, "ПРОХЛАДНЫЙ" => 743, "ПСКОВ" => 744, "ПУГАЧЕВ" => 745, "ПУШКИН" => 746, "ПЫЛТСАМАА" => 747, "ПЯРНУ" => 748, 
			"ПЯТИГОРСК" => 749, "РАДВИЛИКШИС" => 750, "РАДУЖНЫЙ" => 751, "РАЗДАН" => 752, "РАКВЕРЕ" => 753, "РАХОВ" => 754, "РЕВДА" => 755, "РЕЗЕКНЕ" => 756, "РЕЧИЦА" => 757, "РЖЕВ" => 758, "РИГА" => 759, "РОВНО" => 760, 
			"РОГАЧЕВ" => 761, "РОКИШЕС" => 762, "РОМАНОВКА" => 763, "РОМНЫ" => 764, "РОСЛАВЛЬ" => 765, "РОССОШЬ" => 766, "РОСТОВ" => 767, "РОСТОВ НА ДОНУ" => 768, "РТИЩЕВО" => 769, "РУБЕЖНОЕ" => 770, "РУБЦОВСК" => 771, 
			"РУДНЯ" => 772, "РУЗАЕВКА" => 773, "РУСТАВИ" => 774, "РЫБИНСК" => 775, "РЫБНИЦА" => 776, "РЫЛЬСК" => 777, "РЯЖСК" => 778, "РЯЗАНЬ" => 779, "САЛАВАТ" => 780, "САЛДУС" => 781, "САЛЕХАРД" => 782, "САЛЬСК" => 783, 
			"САМАРА" => 784, "САМАРГА" => 785, "САМБОР" => 786, "САМТРЕДИА" => 787, "САНКТ-ПЕТЕРБУРГ" => 788, "САРАКТАШ" => 789, "САРАНСК" => 790, "САРАНЬ" => 791, "САРАПУЛ" => 792, "САРАТОВ" => 793, "САРКАНД" => 794, 
			"САРНЫ" => 795, "САРЫОЗЕК" => 796, "САФОНОВО" => 797, "СВАТОВО" => 798, "СВЕРДЛОВСК" => 799, "СВЕТЛОГОРСК" => 1091, "СВЕТЛОГОРСК" => 800, "СВЕТЛОГОРСК" => 801, "СВЕТЛОГРАД" => 802, "СВЕТЛЫЙ" => 803, "СВОБОДНЫЙ" => 804,
			"СЕБЕЖ" => 805, "СЕВАН" => 806, "СЕВАСТОПОЛЬ" => 807, "СЕВЕРОДВИНСК" => 808, "СЕВЕРОМОРСК" => 809, "СЕВЕРОУРАЛЬСК" => 810, "СЕГЕЖА" => 811, "СЕЛЕНГИНСК" => 812, "СЕМЕНОВ" => 813, "СЕМИПАЛАТИНСК" => 814, "СЕНГИЛЕЙ" => 815, 
			"СЕРГАЧ" => 816, "СЕРДОБСК" => 817, "СЕРНУР" => 818, "СЕРОВ" => 819, "СЕРПУХОВ" => 820, "СИГУЛДА" => 821, "СИЛЛАМЯЭ" => 822, "СИМ" => 823, "СИМФЕРОПОЛЬ" => 824, "СИНЕГОРЬЕ" => 825, "СИНЕЛЬНИКОВО" => 826, "СИСИАН" => 827, 
			"СКАДОВСК" => 828, "СКВИРА" => 829, "СКОВОРОДИНО" => 830, "СЛАВЯНСК" => 831, "СЛАВЯНСК НА КУБАНИ" => 832, "СЛАНЦЫ" => 833, "СЛОБОДЗЕЯ" => 834, "СЛОНИМ" => 835, "СЛУЦК" => 836, "СМЕЛА" => 837, "СМОЛЕВИЧИ" => 838, 
			"СМОЛЕНСК" => 839, "СМОРГОНЬ" => 840, "СОВЕТСК" => 841, "СОВЕТСКИЙ" => 842, "СОЛИКАМСК" => 843, "СОРОКИ" => 844, "СОРТАВАЛА" => 845, "СОСЬВА" => 846, "СОФИЙСК" => 847, "СОФПОРОГ" => 848, "СОЧИ" => 849, 
			"СПАССК ДАЛЬНИЙ" => 850, "СПИТАК" => 851, "СРЕТЕНСК" => 852, "СТАВРОПОЛЬ" => 853, "СТАРАЯ РУССА" => 854, "СТАРОБЕЛЬСК" => 855, "СТАРЫЙ ОСКОЛ" => 856, "СТАХАНОВ" => 857, "СТЕПАНАВАН" => 858, "СТЕРЛИТАМАК" => 859, 
			"СТОЙБА" => 860, "СТОЛБЦЫ" => 861, "СТРЕЖЕВОЙ" => 862, "СТРЫЙ" => 863, "СУВОРОВ" => 864, "СУДЖА" => 865, "СУЗДАЛЬ" => 866, "СУЗУН" => 867, "СУМЫ" => 868, "СУОЯРВИ" => 869, "СУРА" => 870, "СУРГУТ" => 871, 
			"СУРОВИКИНО" => 872, "СУРСКОЕ" => 873, "СУСУМАН" => 874, "СУУРЕ ЯАНИ" => 875, "СУХИНИЧИ" => 876, "СУХУМИ" => 877, "СЫЗРАНЬ" => 878, "СЫКТЫВКАР" => 879, "ТАВДА" => 880, "ТАГАНРОГ" => 881, "ТАЙШЕТ" => 882, 
			"ТАЛДЫ-КУРГАН" => 883, "ТАЛИЦА" => 884, "ТАЛЛИН" => 885, "ТАЛОВАЯ" => 886, "ТАЛЬНОЕ" => 887, "ТАМБОВ" => 888, "ТАПА" => 889, "ТАРА" => 890, "ТАРАКЛИЯ" => 891, "ТАРТУ" => 892, "ТАУРАГЕ" => 893, "ТАШКЕНТ" => 1090, 
			"ТАШТАГОЛ" => 894, "ТБИЛИСИ" => 895, "ТВЕРЬ КАЛИНИН" => 896, "ТЕКЕЛИ" => 897, "ТЕЛАВИ" => 898, "ТЕЛЬШЯЙ" => 899, "ТЕМИРТАУ" => 900, "ТЕРЕК" => 901, "ТЕРНОПОЛЬ" => 902, "ТИГИЛЬ" => 903, "ТИКСИ" => 904, 
			"ТИЛИЧИКИ" => 905, "ТИРАСПОЛЬ" => 906, "ТИХВИН" => 907, "ТИХОРЕЦК" => 908, "ТКВАРЧЕЛИ" => 909, "ТКИБУЛИ" => 910, "ТОБОЛЬСК" => 911, "ТОКМАК" => 912, "ТОЛЬЯТТИ" => 913, "ТОМСК" => 914, "ТОРЖОК" => 915, "ТОТЬМА" => 916, 
			"ТРОИЦК" => 917, "ТРОИЦКО-ПЕЧЕРСК" => 918, "ТРУБЧЕВСК" => 919, "ТУАПСЕ" => 920, "ТУГУР" => 921, "ТУЙМАЗЫ" => 922, "ТУКУМС" => 923, "ТУЛА" => 924, "ТУЛУН" => 925, "ТУЛЬЧИН" => 926, "ТУРА" => 927, "ТУРИНСК" => 928, 
			"ТЫМСК" => 929, "ТЫНДА" => 930, "ТЫРВА" => 931, "ТЮКАЛИНСК" => 932, "ТЮМЕНЬ" => 933, "УВА" => 934, "УВАРОВО" => 935, "УГЛИЧ" => 936, "УЖГОРОД" => 937, "УЖУР" => 938, "УЗЛОВАЯ" => 939, "УКМЕРГЕ" => 940, "УЛАН-УДЕ" => 941, 
			"УЛЬЯНОВСК" => 942, "УМАНЬ" => 943, "УНГЕНЫ" => 944, "УРАЙ" => 945, "УРДЖАР" => 946, "УРЕНЬ" => 947, "УРЖУМ" => 948, "УРЮПИНСК" => 949, "УСИНСК" => 950, "УСМАНЬ" => 951, "УСОГОРСК" => 952, "УСОЛЬЕ СИБИРСКОЕ" => 953, 
			"УССУРИЙСК" => 954, "УСТЬ АВАМ" => 955, "УСТЬ БЕЛАЯ" => 956, "УСТЬ ИЛИМСК" => 957, "УСТЬ КАМЧАТСК" => 958, "УСТЬ КУТ" => 959, "УСТЬ МАЯ" => 960, "УСТЬ НЕРА" => 961, "УСТЬ ОРДЫНСКИЙ" => 962, "УСТЬ-КАМЕНОГОРСК" => 963, 
			"УСТЬ-ТАРКА" => 964, "УТЕНА" => 965, "УТТА" => 966, "УФА" => 967, "УХТА" => 968, "УШТОБЕ" => 969, "ФАЛЕШТЫ" => 970, "ФАСТОВ" => 971, "ФЕОДОСИЯ" => 972, "ФЛОРЕШТЫ" => 973, "ФОРОС" => 974, "ФРОЛОВО" => 975, 
			"ХААПСАЛУ" => 976, "ХАБАРОВСК" => 977, "ХАНДЫГА" => 978, "ХАНТЫ-МАНСИЙСК" => 979, "ХАРАБАЛИ" => 980, "ХАРОВСК" => 981, "ХАРЬКОВ" => 982, "ХАСАВЮРТ" => 983, "ХАСАН" => 984, "ХАТАНГА" => 985, "ХАШУРИ" => 986, 
			"ХВАЛЫНСК" => 987, "ХЕРСОН" => 988, "ХИЛОК" => 989, "ХИМКИ" => 990, "ХМЕЛЬНИЦКИЙ" => 991, "ХОВУ-АКСЫ" => 992, "ХОЙНИКИ" => 993, "ХОЛМСК" => 994, "ХОТИН" => 995, "ЦЕСИС" => 996, "ЦИТЕЛИ-ЦКАРО" => 997, "ЦНОРИ" => 998, 
			"ЦУЛУКИДЗЕ" => 999, "ЦХАКАЯ" => 1000, "ЦХАЛТУБО" => 1001, "ЦХИНВАЛ" => 1002, "ЦЮРУПИНСК" => 1003, "ЧАДЫР-ЛУНГА" => 1004, "ЧАЙКОВСКИЙ" => 1005, "ЧАПЛЫГИН" => 1006, "ЧАРЕНЦАВАН" => 1007, "ЧАРСК" => 1008, "ЧЕБОКСАРЫ" => 1009, 
			"ЧЕГДОМЫН" => 1010, "ЧЕЛЯБИНСК" => 1011, "ЧЕРВОНОГРАД" => 1012, "ЧЕРДАКЛЫ" => 1013, "ЧЕРЕМУШКИ" => 1014, "ЧЕРЕМХОВО" => 1015, "ЧЕРЕПОВЕЦ" => 1016, "ЧЕРКАССЫ" => 1017, "ЧЕРКЕССК" => 1018, "ЧЕРЛАК" => 1019, 
			"ЧЕРНИГОВ" => 1020, "ЧЕРНОБЫЛЬ" => 1021, "ЧЕРНОВЦЫ" => 1022, "ЧЕРНОГОРСК" => 1023, "ЧЕРНОМОРСКОЕ" => 1024, "ЧЕРНОРЕЧЕНСКИЙ" => 1025, "ЧЕРНУШКА" => 1026, "ЧЕРНЯХОВСК" => 1027, "ЧЕРСКИЙ" => 1028, "ЧИАТУРА" => 1029, 
			"ЧИСТОПОЛЬ" => 1030, "ЧИТА" => 1031, "ЧИШМИКИОЙ" => 1032, "ЧОП" => 1033, "ЧОРТКОВ" => 1034, "ЧУГУЕВ" => 1035, "ЧУДОВО" => 1036, "ЧУЛЫМ" => 1037, "ЧУМИКАН" => 1038, "ЧУСОВОЙ" => 1039, "ШАДРИНСК" => 1040, "ШАРЬЯ" => 1041, 
			"ШАУЛЯЙ" => 1042, "ШАХТЕРСК" => 1043, "ШАХТИНСК" => 1044, "ШАХТЫ" => 1045, "ШАХУНЬЯ" => 1046, "ШВЕНЧЕНЕЛЯЙ" => 1047, "ШЕБЕКИНО" => 1048, "ШЕМОНАИХА" => 1049, "ШЕМЯТИНО" => 1050, "ШЕПЕТОВКА" => 1051, "ШИЛОВО" => 1052, 
			"ШИМАНОВСК" => 1053, "ШИРА" => 1054, "ШОЛОХОВСКИЙ" => 1055, "ШОСТКА" => 1056, "ШУМЕРЛЯ" => 1057, "ШУМИХА" => 1058, "ШУЯ" => 1059, "ЩЕКИНО" => 1060, "ЩЕЛКОВО" => 1061, "ЩЕРБАКТЫ" => 1062, "ЩИГРЫ" => 1063, "ЩОРС" => 1064, 
			"ЫРБАН" => 1065, "ЭКИБАСТУЗ" => 1066, "ЭЛЕЯ" => 1067, "ЭЛИСТА" => 1068, "ЭЛЬВА" => 1069, "ЭНГЕЛЬС" => 1070, "ЭНЕРГЕТИК" => 1071, "ЭРТИЛЬ" => 1072, "ЭЧМИАДЗИН" => 1073, "ЮЖА" => 1074, "ЮЖНО САХАЛИНСК" => 1075, 
			"ЮЖНО-СУХОКУМСК" => 1076, "ЮЖНОУРАЛЬСК" => 1077, "ЮРГА" => 1078, "ЮРИБЕЙ" => 1079, "ЮРМАЛА" => 1080, "ЮРЬЯ" => 1081, "ЮСТА" => 1082, "ЯДРИНО" => 1083, "ЯКУТСК" => 1084, "ЯЛТА" => 1085, "ЯРАНСК" => 1086, "ЯРОСЛАВЛЬ" => 1087, 
			"ЯШКУЛЬ" => 1088
		];
		$city=(new Citys)->where('city_id',$todo['birthCity'] )->select('city_name')->get()->toArray();
		$birthDate=date_parse_from_format("Y-m-d H:i:s",$todo['birthDate']);
		curl_setopt_array($myCurl, array(
			CURLOPT_URL => 'https://astro-online.ru/ajax/ajax.city.php?city='.$citiesArr [mb_strtoupper ( $city[0]["city_name"])] .'&birthyear='.$birthDate['year'] ,
			CURLOPT_COOKIEFILE=>env('ASTRO_COOKIE_FILE', 'C:\wamp\www\LIFE_PLAN\storage\app\cookie.txt')
		));
		$response =json_decode ( preg_replace('/[{]/', '{"', preg_replace('/[:]/', '":', preg_replace('/[,]/', ',"', preg_replace('/[\x00-\x1F\x7F\s]/', '', curl_exec($myCurl)) ))) );
		curl_setopt_array($myCurl, array(
			CURLOPT_URL => 'https://astro-online.ru/view.php',
			CURLOPT_RETURNTRANSFER => true,
			CURLOPT_POST => true,
			CURLOPT_POSTFIELDS => http_build_query(['u_namez'=>$todo['firstName'], 'dayz'=>$birthDate['day'], 'monthz'=>$birthDate['month'], 'yearz'=>$birthDate['year'], 'hourz'=>$birthDate['hour'], 'minutz'=>$birthDate['minute'],
				'N'=>$response->N , 'E'=>$response->E, 	'frm_autogmt'=>'on', 'time_gmt'=>$response->GMT, 'city'=>$response->city_id, 'f_high_pln'=>'yes', 'sun'=>'yes', 'moon'=>'yes', 'mercury'=>'yes', 'venus'=>'yes', 'mars'=>'yes', 'jupiter'=>'yes',
				'saturn'=>'yes', 'uran'=>'yes', 'neptun'=>'yes', 'pluton'=>'yes', 'node'=>'yes', 'snode'=>'no', 'lilit'=>'no', 'selena'=>'no', 'prozerpina'=>'no', 'hiron'=>'no', 'het1'=>'no', 
				'sakoyan1'=>'yes', 'globa1'=>'no', 'podvodniy1'=>'no', 'katrin1'=>'no', 'mariya1'=>'no', 'het2'=>'no', 'podvodniy2'=>'no', 'katrin2'=>'yes', 'globa3'=>'yes', 'het4'=>'no', 'sakoyan4'=>'no',
				'podvodniy3'=>'no', 'izraitel4'=>'yes', 'ruler5'=>'yes', 'tranz10'=>'yes', 'solar12'=>'yes', 'shulman14'=>'yes', 'nazarova9'=>'yes', 'nazarova10'=>'yes', 'nazarova11'=>'yes', 'sakoyan10'=>'no',
				'conj1'=>'0', 'conj2'=>'5', 'sekst1'=>'52', 'sekst2'=>'68', 'kvad1'=>'82', 'kvad2'=>'98', 'trin1'=>'112', 'trin2'=>'128', 'opp1'=>'172', 'opp2'=>'180', 'leto_zima'=>'yes', 'sort_asp'=>'0', 'gamma'=>'1',
				'house'=>'0', 'cat_id'=>'9', 'ssid'=>$ssid[0]->attr['value'], 'zerocool'=>'%D0%E0%F1%F1%F7%E8%F2%E0%F2%FC']),
			CURLOPT_COOKIESESSION=>true,
			CURLOPT_COOKIEFILE=>env('ASTRO_COOKIE_FILE', 'C:\wamp\www\LIFE_PLAN\storage\app\cookie.txt')
		));
		$response = str_get_html( iconv('CP1251','UTF-8',curl_exec($myCurl)) );
		$data=$response->find('td[id=navitable]', 1);
		$table=$data->find('table', 0);
		$astros=convertToAssArr( (new Astro)->select('rec_id', 'name')->get()->toArray(), 'name');
		$astros2prof= (new Astro2Prof)->select('astro_id', 'prof_id')->get()->toArray();
		$profs=$rates=array();
		foreach($astros as $astro){
			foreach($astros2prof as $prof)
				if($prof['astro_id'] == $astro['rec_id'])
					$profs[$astro['name']][]=$prof['prof_id'];		
			$rates[$astro['name']]=['rate'=>0, 'descr'=>'', 'astro_id'=>$astro['rec_id'], 'name'=>$astro['name'] ];
		}
		foreach($table->find('tr') as $tr){
			//выведем данный элемент
			if(count($tr->find('td'))<1 )
				continue;
			$aspect=trim ( $tr->find('td',0)->plaintext) ;
			$rates [$aspect]['rate'] +=(int)$tr->find('td',1)->plaintext;
			$rates [$aspect]['descr'] .= preg_replace('/\(см\. исследование базы SADC\)/', '',  preg_replace('/[\x00-\x1F\x7F]/', '', $tr->find('td', count($tr->find('td'))-1)->plaintext)) .' ' ;
		}
		$response->clear();

		foreach($rates  as $rate  ){
			if($rate['rate']==0)
				continue;
			(new Astro2User)->insert(['astro_id'=>$rate['astro_id'], 'user_id'=>Auth::user()->id, 'rate'=>$rate['rate'], 'description'=>$rate['descr']]);
			foreach($profs[$rate['name']] as $prof )
				$match->insert(['user_id'=>Auth::user()->id, 'prof_id'=>$prof, 'rate'=>$rate['rate'], 'type'=>'astro']);	
		}
	}

    public  function isFavorite($spec_id){
        if (nvl($spec_id)<= 0)
			return false;
		$tmp=$this->where('id',Auth::user()->id )->select('favoritProfs')->get();
		$Profs=explode(",",$tmp[0]->favoritProfs);
		$specs=(new spec2prof())->getMySpec($Profs);
		foreach($specs as $spec)
			if ($spec_id == $spec->spec_id)
				return true;
		return false;
		
    }
    
}